package model;

import java.util.List;

/**----------------------------------------------------------------------*
 *■■■ItemsDtoクラス■■■
 *概要：DTO（「items」テーブル）
 *----------------------------------------------------------------------**/
public class CartSelectBL {

	//----------------------------------------------------------------
	//フィールド
	//----------------------------------------------------------------

	public List<CartSelectDto> executeSelectItems(int id) {

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆itemsテーブルからデータ取得
		CartDao dao = new CartDao();
		List<CartSelectDto> dtoList= dao.doSelect(id);

		return dtoList;


	}

}
